11/data/attachments/510565b57dca1969.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_04f8f895-f6fc-4df2-b9a3-58cd98de6d1c</nif:username>
            <nif:friendToBeAdded>Christopher_watch_Friend_39234_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>